app/Http/Controllers/MemberController.php

select * from `members` limit 7 offset 0
select count(*) as aggregate from `members`
---
    public function index()
    {
        // sort with kyslik composer method sortable()
        // sort with kyslik composer
        $members = Member::sortable()->paginate(7);

select * from `mutuals` order by `name` asc
select * from `pensions` order by `name` asc
select * from `activities`
---
    public function create()
    {
        $mutuals = Mutual::orderBy('name', 'asc')->get();
        $pensions = Pension::orderBy('name', 'asc')->get();
        $activities = Activity::all();

select * from `activities`
select * from `pensions`
select * from `mutuals`
---
    public function edit(Member $member)
    {
        $activities = Activity::all();
        $pensions = Pension::all();
        $mutuals = Mutual::all();

delete from `activity_member` where `member_id` = '14'
delete from `members` where `id` = '14'
---
    public function destroy(Member $member)
    {
        // Delete first the member in the pivot table "activity_member"
        $deleteMemberActivity = DB::table('activity_member')->where('member_id','=',$member->id);
        $deleteMemberActivity->delete();
        // Then delete the member in the members table

        $member->delete();