app/Http/Controllers/MutualController.php

    public function index()
    {
        // sort with kyslik composer method sortable()
        $mutuals = Mutual::sortable('name')->paginate(7);
---
select * from `mutuals` order by `mutuals`.`name` desc limit 7 offset 0
select count(*) as aggregate from `mutuals`