app/Http/Controllers/PensionController.php

select * from `pensions` order by `pensions`.`id` desc limit 7 offset 0
select count(*) as aggregate from `pensions`
---
    public function index()
    {
        // sort with kyslik composer method sortable()
        $pensions = Pension::sortable()->paginate(7);